<template>
    <div class="home">
        <el-row>
            <el-col :span="24">
                <div class="grid-content bg-purple-dark">
                    <ul id="example-1">
                        <li v-for="item in heroes">
                            <el-button class="hero" width="400" @click="toDetail(item.key)">
                                {{ item.name }}
                            </el-button>
                        </li>

                    </ul>
                </div>
            </el-col>
        </el-row>

    </div>
</template>

<script>
    // @ is an alias to /src
    export default {
        name: 'home',
        components: {},

        data() {
            return {
                heroes: [
                    {name: "斧王", key: "axe"},
                    {name: "黑暗游侠", key: "drow_ranger"},
                ],
                heroDatas: {
                    drow_ranger: {
                        "abilities": {
                            "霜冻之箭": {
                                "desc": "卓尔游侠在箭矢中附上冰冻效果，减缓敌人的移动速度。对英雄持续1.5秒，对普通单位持续7.0秒。",
                                "detail": "对英雄持续时间： 1.5,对小兵持续时间： 7.0,移速减缓： -16 -32 -48 -64%,影响： 敌方单位,技能： 单位目标,自动施放,伤害： 0 0 0 0,无视技能免疫： 否,魔法消耗:12 12 12 12,冷却时间:0.0 0.0 0.0 0.0,"
                            },
                            "狂风": {
                                "desc": "释放一阵狂风，沉默敌方单位并将其击退。击退距离与敌人和卓尔游侠的距离成反比。",
                                "detail": "施法距离： 900,作用宽度： 250,击退持续时间： 0.6 0.7 0.8 0.9,沉默持续时间： 3 4 5 6,最大击退距离： 350,技能： 点目标,无视技能免疫： 否,魔法消耗:90,冷却时间:16 15 14 13,"
                            },
                            "精准光环": {
                                "desc": "提高所有友方远程英雄的攻击速度，提升数值是卓尔游侠敏捷值的一定百分比。施放后对所有普通单位生效，持续30秒。",
                                "detail": "远程攻击速度提升： 20 40 60 80%,技能： 无目标,冷却时间:100,"
                            },
                            "射手天赋": {
                                "desc": "卓尔游侠的战斗经验使她有概率发出极其精准高效的箭矢。箭矢将穿透敌人的防御，无视他们的基础护甲。立刻击杀非英雄单位，并且击中英雄时额外造成物理伤害。如果400范围内有敌方英雄，本技能没有效果。可用神杖升级。",
                                "detail": "额外触发伤害： 120 130 140,神杖升级分裂箭矢数： 2,概率： 20 30 40%,分裂范围： 375,神杖升级伤害降低： 50%,技能： 被动,"
                            }
                        },
                        "name": "drow_ranger",
                        "talent": {
                            "10": "+5 全属性,+20 移动速度",
                            "15": "+30% 狂风致盲,+14 敏捷",
                            "20": "+3秒 狂风沉默,25% 闪避",
                            "25": "50% 冷却时间减少,+25% 精准光环攻击速度"
                        },
                        "name_cn": "卓尔游侠 ",
                        "type": "agi",
                        "attr": {
                            "敏捷": "29",
                            "力量": "17",
                            "智力": "15",
                            "攻击力": "",
                            "护甲": "",
                            "移动速度": "285",
                            "DPS(攻速)": "",
                            "生命值": "",
                            "魔法值": "",
                            "转身速度": "0.7000",
                            "攻击前摇": "0.65",
                            "str_add": "1.900000",
                            "int_add": "1.400000",
                            "agi_add": "2.800000",
                            "attack_min": "19",
                            "attack_max": "30",
                            "armor_init": "-3"
                        }
                    },
                    axe: {
                        "abilities": {
                            "狂战士之吼": {
                                "desc": "斧王嘲讽附近的敌方单位，强迫他们攻击自己，同时获得额外护甲。",
                                "detail": "护甲提升： 30,持续时间： 2.0 2.4 2.8 3.2,作用范围： 300,技能： 无目标,伤害： 0 0 0 0,无视技能免疫： 是,魔法消耗:80 90 100 110,冷却时间:16 14 12 10,"
                            },
                            "战斗饥渴": {
                                "desc": "激怒一个敌方单位，使他受到减速和持续伤害，直到他杀死一个单位或者持续时间结束为止。斧王从每个受战斗饥渴影响的敌人身上获得移动速度加成，非英雄单位提供半额效果。可用神杖升级。",
                                "detail": "移动速度减缓： -12%,移动速度提升： 12%,持续时间： 12.0,神杖升级作用范围： 400,每秒伤害： 16 24 32 40,神杖升级伤害降低： 30%,影响： 敌方单位,技能： 单位目标,伤害类型： 魔法,无视技能免疫： 否,魔法消耗:50 60 70 80,冷却时间:20.0 15.0 10.0 5.0,"
                            },
                            "反击螺旋": {
                                "desc": "受攻击时，斧王做出螺旋反击，对附近所有敌方单位造成纯粹伤害。",
                                "detail": "作用范围： 275,反击概率： 20%,伤害： 60 100 140 180,技能： 被动,伤害类型： 纯粹,无视技能免疫： 是,冷却时间:0.45 0.4 0.35 0.3,"
                            },
                            "淘汰之刃": {
                                "desc": "斧王寻找弱点来出击，直接秒杀低血量的敌方单位，血量如果过高则只造成一定伤害。当秒杀的是敌方英雄时，本技能不会进入冷却时间。同时斧王和附近友军单位获得移动速度加成。",
                                "detail": "伤害： 150 250 300,斩杀后移动速度加成： 30%,秒杀血量： 250 325 400,斩杀后加速范围： 900,斩杀后攻击速度加成： 30,斩杀加速持续时间： 6,影响： 敌方单位,技能： 单位目标,伤害类型： 魔法,无视技能免疫： 是,魔法消耗:60 120 180,冷却时间:75.0 65.0 55.0,"
                            }
                        },
                        "name": "axe",
                        "talent": {
                            "10": "+40 攻击速度,+8 力量",
                            "15": "+30 移动速度,+3 魔法恢复",
                            "20": "攻击触发反击螺旋,+25 生命恢复",
                            "25": "+120 战斗饥渴每秒伤害,+100 狂战士之吼范围"
                        },
                        "name_cn": "斧王 ",
                        "type": "str",
                        "attr": {
                            "敏捷": "20",
                            "力量": "25",
                            "智力": "18",
                            "攻击力": "",
                            "护甲": "",
                            "移动速度": "305",
                            "DPS(攻速)": "",
                            "生命值": "",
                            "魔法值": "",
                            "转身速度": "0.600000",
                            "攻击前摇": "0.500000",
                            "str_add": "3.400000",
                            "int_add": "1.600000",
                            "agi_add": "2.200000",
                            "attack_min": "27",
                            "attack_max": "31",
                            "armor_init": "-1"
                        }
                    }
                }
            }
        },
        methods: {
            toDetail(key) {
                this.$router.push({name:'detail',params:{detail:this.heroDatas[key]}})
            }
        }
    }
</script>
<style>
    ul {
        list-style: none;
    }

    .hero {
        width: 100%;
    }

    li {
        padding-top: 10px;

    }
</style>
